app/controllers/bands_controller.rb

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "Jay Chou"], ["updated_at", "2019-02-01 01:00:19.420893"], ["id", 1]]
---
    def update
        @band = Band.find(params[:id])
        if @band.update(band_params)

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 1]]
---
    def destroy
        @band = Band.find(params[:id])
        @band.destroy